<script setup lang="ts">

/* 
    Здесь по-братски описан план разработки проекта

    На случай, если у тебя нет идей
*/

</script>

<template>
    <h2>План разработки проекта "динамичная подгрузка данных"</h2>

    <ol>
        <li>Создать функцию, которая будет подгружать n-ное количество товаров для старта</li>
        <li>При докручивании до определённого этапа (по высоте карточки), запускать функцию подгрузки товаров и заливать их
            на страницу</li>
        <li>Когда прокрутка меньше, чем высота карточки, товары прячем</li>
        <li>Основа проекта: <b>все вычисления отталкиваются либо от низа страницы, либо от высоты последней карточки</b>
        </li>
        <li>Другими словами, у нас на руках всегда должны быть последняя карточка - и её высота, или же низ страницы</li>
    </ol>
</template>

<style lang="scss" scoped></style>